{
  "id": 2,
  "slug": "beauty-cream-lp",
  "thumbnail": "/works2.jpg",
  "ogpImage": "/ogp-works2.png",
  "domain": "beauty-cream_lp",
  "name": "Assignment",
  "description": "Assignment | This is a landing page created for a fictional beauty product as an assignment for Digital Hollywood online school. The target audience for this product is women aged 25 to 39 with an interest in skincare. The page has a calming design that complements the product's color scheme, making it visually appealing to the target audience. It includes a main visual, campaign banner, product description, steps to use the product, customer reviews, and an FAQ section.",
  "url": "https://shunssv.github.io/beauty-cream_lp/",
  "summary": "As a student of Digital Hollywood online school, I chose the assignment to create a landing page for a fictional beauty product that would be promoted in October. The target audience for the product was women between the ages of 25 and 39 who were interested in skincare. I am pleased to present the final version of this page, which I have revised based on feedback received from the school. The landing page has a clean and calming design that complements the product's color scheme, making it visually appealing to the target audience. It features a main visual that instantly grabs the user's attention, followed by a campaign banner that highlights the product's key selling points. A product description emphasizes the benefits of the product. In addition, there are steps to use the product, customer reviews that provide social proof, and an FAQ section that addresses commonly asked questions.",
  "comment": "This was my first time building a webpage from scratch, and I faced a range of challenges in the process. I had to code with semantic HTML, choose appropriate class names, and create responsive layouts. Prior to this assignment, I had only worked on fixed content with HTML and CSS, so the task of building a page from scratch was a significant challenge. As I worked on the project, I attempted to incorporate new styles and features to enhance the overall design. Through the process, I gained valuable experience working with CSS and UI using JavaScript (jQuery). I encountered some difficulties with implementing the hamburger menu and accordion, but I was able to resolve these issues by researching solutions. Despite the challenges, I found the experience to be both enjoyable and rewarding. It was exciting to discover new things about coding and to gain confidence in my web development skills. This project allowed me to further refine my abilities and take my skills to the next level.",
  "languages": ["html", "css", "javascript"],
  "frameworks": ["jquery"],
  "tools": ["notion", "toggl", "pinterest", "xd", "photoshop", "google fonts", "unsplash", "adobe stock", "vscode", "github", "git", "terminal"],
  "roles": ["planning", "design", "coding", "updating"]
}