{
  "id": 1,
  "slug": "enk-english",
  "image": "/works1.jpg",
  "domain": "enk-english.online",
  "name": "ENK English",
  "description": "ENK English is an English tutoring organization for Japanese students. The organization's main source of new customers was word-of-mouth referrals and a poster for promotion. I proposed building a website to reach more potential customers. The website has three main pages: Home, Contact, and 404. The Home page describes the organization's services and how it differs from other tutoring services. The Contact page provides contact information, and the 404 page provides a friendly message if a visitor tries to access a non-existent page. The website is designed to be friendly and approachable, with yellow and orange as the main colors. In the future, the website will be expanded to include members-only page for the students.",
  "url": "https://enk-english.online/",
  "summary": "ENK English is an English tutoring organization that helps Japanese students improve their English skills for everyday life. Previously, the organization's main source of new customers was word-of-mouth referrals and a poster for promotion. I proposed that they build a website as a first step to reach more potential customers. The website has three main pages: Home, Contact, and 404. The Home page describes what ENK English offers and how it differs from other English tutoring services. The Contact page provides information on how to reach ENK English, and the 404 page provides a friendly message if a visitor tries to access a page that does not exist. In designing the website, I used yellow and orange as the main colors to reflect the organization's branding and create a friendly and approachable design. The website aims to make visitors feel at ease and comfortable while exploring the available services. In the future, the website will be expanded to include members-only page for ENK English students. This will allow students to access additional resources to help them improve their English skills.",
  "comment": "This was my first project using WordPress. Although I had a basic understanding of HTML and CSS, building a custom theme on the CMS was a new challenge. The contact page was particularly challenging. Not only did I need to create an input page, but I also needed to create a confirmation page and a completion page. I also struggled to configure form validation using a plugin, but eventually, I overcame these obstacles and created a functional contact page. During the project, I also discovered the Intersection Observer API and implemented it in the scroll-to-top button. I found it easy to introduce and well-organized, and it provided a valuable learning experience in front-end development. As a result, I am now more confident in my abilities as a web developer and eager to tackle new challenges in the future. I am grateful to ENK English for giving me this opportunity. I am proud of the work that I did on this project, and I believe that it will be a valuable asset to ENK English.",
  "languages": ["html", "css", "javascript", "php"],
  "frameworks": ["wordpress", "jquery"],
  "tools": ["notion", "clickup", "miro", "toggl", "pinterest", "xd", "photoshop", "illustrator", "google fonts", "adobe fonts", "adobe stock", "vscode", "local", "github", "git", "terminal", "filezilla"],
  "roles": ["planning", "design", "coding", "updating"]
}